{
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.2,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "bacterial_leaf_blight",
    "1": "brown_spot",
    "2": "healthy",
    "3": "leaf_blast",
    "4": "leaf_scald",
    "5": "narrow_brown_spot"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "bacterial_leaf_blight": 0,
    "brown_spot": 1,
    "healthy": 2,
    "leaf_blast": 3,
    "leaf_scald": 4,
    "narrow_brown_spot": 5
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
